app/views/quotation/quotation.html.erb

      <%= form.label :"New Category" %>
      <%= form.select :category2, Quotation.pluck(:category).uniq,include_blank: true %>
---
SELECT "quotations"."category" FROM "quotations"