app/views/items/_form.html.erb

SELECT "items"."category" FROM "items"
---
    <%= form.label :"New Category" %>
    <%= form.select :category2, Item.pluck(:category).uniq,include_blank: true %>