app/views/items/_form.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <%#= form.text_field :category_id %>
    <%= text_field_tag(Category,value=Category.find(params["category_id"]).name,disabled: true) %>