app/views/items/index.html.erb

  <div class="ui container">
    <h1 style="color:white;font-weight: bold;text-align: center;font-family: 'Courier New';margin-top:5%"><%=Category.find(params['category_id']).name %></h1>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]