app/controllers/categories_controller.rb

  def index
    @categories = Category.all.order("id ")
---
SELECT "categories".* FROM "categories" ORDER BY id Desc