app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def index
    # @items = Item.all
    @items = Item.where("category_id":params['category_id']).all

INSERT INTO "items" ("name", "description", "category", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Rice"], ["description", "this is description"], ["category", "Hey "], ["price", 15.0], ["created_at", "2019-11-06 11:51:40.963279"], ["updated_at", "2019-11-06 11:51:40.963279"]]
---
  def create
    # debugger
    @item = Item.new(item_params)

    @item.category_id = params["category_id"]

    # debugger
    respond_to do |format|
      if @item.save

UPDATE "items" SET "updated_at" = $1 WHERE "items"."id" = $2  [["updated_at", "2019-11-08 13:07:12.101015"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)