app/controllers/quotation_controller.rb

  def quotation
    # @quotations=Quotation.all
    # @category=Quotation.pluck(:category).uniq
    #debugger
    # @quotation=Quotation.where(["quote LIKE ?","%#{params[:search]}%"])
    # @quotation=Quotation.search(params[:search])
    if params[:quotation]
      @quotation = Quotation.new( quotation_params )
      # debugger
      if params[:quotation][:category2]==""
        @quotation.category=params[:quotation][:category]
      else
        @quotation.category=params[:quotation][:category2]
      end
      if @quotation.save
        flash[:notice] = 'Quotation was successfully created.'
        @quotation = Quotation.new
      end
    else
      @quotation = Quotation.new
    end
    if params[:sort_by] == "date"
      @quotations = Quotation.order(:created_at)
    else
      @quotations = Quotation.order(:category)
---
INSERT INTO "quotations" ("author_name", "category", "quote", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", "mahesh"], ["category", "student"], ["quote", "drtfyuhiojjhgfd"], ["created_at", "2019-10-04 11:38:42.457533"], ["updated_at", "2019-10-04 11:38:42.457533"]]
SELECT "quotations".* FROM "quotations" ORDER BY "quotations"."created_at" ASC
SELECT "quotations".* FROM "quotations" ORDER BY "quotations"."category" ASC

  def index
    @quotation=Quotation.search(params[:search].downcase)
---
SELECT "quotations".* FROM "quotations" WHERE (quote LIKE '%life%')

  def export
    @quotationS=Quotation.all
---
SELECT "quotations".* FROM "quotations"